Ran Plan for 5 projects:

1. project: `resources_projects_project-002` dir: `resources/projects/project-002` workspace: `resources_projects_project-002`
1. project: `resources_projects_project-001` dir: `resources/projects/project-001` workspace: `resources_projects_project-001`
1. project: `resources_projects_project-001_environments_dev` dir: `resources/projects/project-001/environments/dev` workspace: `resources_projects_project-001_environments_dev`
1. project: `resources_projects_project-001_environments_test` dir: `resources/projects/project-001/environments/test` workspace: `resources_projects_project-001_environments_test`
1. project: `resources_projects_project-001_environments_prod` dir: `resources/projects/project-001/environments/prod` workspace: `resources_projects_project-001_environments_prod`

### 1. project: `resources_projects_project-002` dir: `resources/projects/project-002` workspace: `resources_projects_project-002`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding microsoft/azuredevops versions matching ">= 0.10.0"...
- Installing microsoft/azuredevops v0.10.0...
- Installed microsoft/azuredevops v0.10.0 (signed by a HashiCorp partner, key ID 6F0B91BDE98478CF)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.


Initializing the backend...

Initializing provider plugins...
- Reusing previous version of microsoft/azuredevops from the dependency lock file
- Using previously-installed microsoft/azuredevops v0.10.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuredevops_project.project will be created
+   resource "azuredevops_project" "project" {
+       description         = "Project 002"
+       id                  = (known after apply)
+       name                = "project-002"
+       process_template_id = (known after apply)
+       version_control     = "git"
+       visibility          = "private"
+       work_item_template  = "Agile"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   project_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/atlantis-data/repos/elos-mole/atlantis-demo/3/resources_projects_project-002/resources/projects/project-002/resources_projects_project-002-resources_projects_project-002.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/atlantis-data/repos/elos-mole/atlantis-demo/3/resources_projects_project-002/resources/projects/project-002/resources_projects_project-002-resources_projects_project-002.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p resources_projects_project-002`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.apps.ocp-hashicorp-demo.aws.elostech.cz/lock?id=elos-mole%252Fatlantis-demo%252Fresources%252Fprojects%252Fproject-002%252Fresources_projects_project-002)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p resources_projects_project-002`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. project: `resources_projects_project-001` dir: `resources/projects/project-001` workspace: `resources_projects_project-001`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding microsoft/azuredevops versions matching ">= 0.10.0"...
- Installing microsoft/azuredevops v0.10.0...
- Installed microsoft/azuredevops v0.10.0 (signed by a HashiCorp partner, key ID 6F0B91BDE98478CF)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.


Initializing the backend...

Initializing provider plugins...
- Reusing previous version of microsoft/azuredevops from the dependency lock file
- Using previously-installed microsoft/azuredevops v0.10.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
azuredevops_project.project: Refreshing state... [id=7e58884c-e362-4aaf-9ae1-c813a4f11b37]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p resources_projects_project-001`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.apps.ocp-hashicorp-demo.aws.elostech.cz/lock?id=elos-mole%252Fatlantis-demo%252Fresources%252Fprojects%252Fproject-001%252Fresources_projects_project-001)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p resources_projects_project-001`
</details>
No changes. Your infrastructure matches the configuration.

---
### 3. project: `resources_projects_project-001_environments_dev` dir: `resources/projects/project-001/environments/dev` workspace: `resources_projects_project-001_environments_dev`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding microsoft/azuredevops versions matching ">= 0.10.0"...
- Installing microsoft/azuredevops v0.10.0...
- Installed microsoft/azuredevops v0.10.0 (signed by a HashiCorp partner, key ID 6F0B91BDE98478CF)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.


Initializing the backend...

Initializing provider plugins...
- Reusing previous version of microsoft/azuredevops from the dependency lock file
- Using previously-installed microsoft/azuredevops v0.10.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
azuredevops_environment.environment: Refreshing state... [id=1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p resources_projects_project-001_environments_dev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.apps.ocp-hashicorp-demo.aws.elostech.cz/lock?id=elos-mole%252Fatlantis-demo%252Fresources%252Fprojects%252Fproject-001%252Fenvironments%252Fdev%252Fresources_projects_project-001_environments_dev)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p resources_projects_project-001_environments_dev`
</details>
No changes. Your infrastructure matches the configuration.

---
### 4. project: `resources_projects_project-001_environments_test` dir: `resources/projects/project-001/environments/test` workspace: `resources_projects_project-001_environments_test`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding microsoft/azuredevops versions matching ">= 0.10.0"...
- Installing microsoft/azuredevops v0.10.0...
- Installed microsoft/azuredevops v0.10.0 (signed by a HashiCorp partner, key ID 6F0B91BDE98478CF)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.


Initializing the backend...

Initializing provider plugins...
- Reusing previous version of microsoft/azuredevops from the dependency lock file
- Using previously-installed microsoft/azuredevops v0.10.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuredevops_environment.environment will be created
+   resource "azuredevops_environment" "environment" {
+       description = "TEST environment"
+       id          = (known after apply)
+       name        = "test"
+       project_id  = "7e58884c-e362-4aaf-9ae1-c813a4f11b37"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   environment_id = (known after apply)
+   project_id     = "7e58884c-e362-4aaf-9ae1-c813a4f11b37"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/atlantis-data/repos/elos-mole/atlantis-demo/3/resources_projects_project-001_environments_test/resources/projects/project-001/environments/test/resources_projects_project-001_environments_test-resources_projects_project-001_environments_test.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/atlantis-data/repos/elos-mole/atlantis-demo/3/resources_projects_project-001_environments_test/resources/projects/project-001/environments/test/resources_projects_project-001_environments_test-resources_projects_project-001_environments_test.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p resources_projects_project-001_environments_test`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.apps.ocp-hashicorp-demo.aws.elostech.cz/lock?id=elos-mole%252Fatlantis-demo%252Fresources%252Fprojects%252Fproject-001%252Fenvironments%252Ftest%252Fresources_projects_project-001_environments_test)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p resources_projects_project-001_environments_test`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 5. project: `resources_projects_project-001_environments_prod` dir: `resources/projects/project-001/environments/prod` workspace: `resources_projects_project-001_environments_prod`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding microsoft/azuredevops versions matching ">= 0.10.0"...
- Installing microsoft/azuredevops v0.10.0...
- Installed microsoft/azuredevops v0.10.0 (signed by a HashiCorp partner, key ID 6F0B91BDE98478CF)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.


Initializing the backend...

Initializing provider plugins...
- Reusing previous version of microsoft/azuredevops from the dependency lock file
- Using previously-installed microsoft/azuredevops v0.10.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuredevops_environment.environment will be created
+   resource "azuredevops_environment" "environment" {
+       description = "PROD environment"
+       id          = (known after apply)
+       name        = "prod"
+       project_id  = "7e58884c-e362-4aaf-9ae1-c813a4f11b37"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   environment_id = (known after apply)
+   project_id     = "7e58884c-e362-4aaf-9ae1-c813a4f11b37"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/atlantis-data/repos/elos-mole/atlantis-demo/3/resources_projects_project-001_environments_prod/resources/projects/project-001/environments/prod/resources_projects_project-001_environments_prod-resources_projects_project-001_environments_prod.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/atlantis-data/repos/elos-mole/atlantis-demo/3/resources_projects_project-001_environments_prod/resources/projects/project-001/environments/prod/resources_projects_project-001_environments_prod-resources_projects_project-001_environments_prod.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p resources_projects_project-001_environments_prod`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.apps.ocp-hashicorp-demo.aws.elostech.cz/lock?id=elos-mole%252Fatlantis-demo%252Fresources%252Fprojects%252Fproject-001%252Fenvironments%252Fprod%252Fresources_projects_project-001_environments_prod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p resources_projects_project-001_environments_prod`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`